---
kind: method
id: M:Autodesk.Revit.DB.Electrical.TemperatureRatingTypeSet.Clear
source: html/7b8ff430-86c0-5fc6-1a29-7d7494a8bab4.htm
---
# Autodesk.Revit.DB.Electrical.TemperatureRatingTypeSet.Clear Method

Removes every TemperatureRating type from the set, rendering it empty.

## Syntax (C#)
```csharp
public virtual void Clear()
```